Terraform plan:

```terraform
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.jenkins.aws_iam_instance_profile.jenkins must be replaced
-/+ resource "aws_iam_instance_profile" "jenkins" {
      ~ arn         = "arn:aws:iam::587807691409:instance-profile/jenkins_profile-sandbox" -> (known after apply)
      ~ create_date = "2020-12-14T18:29:12Z" -> (known after apply)
      ~ id          = "jenkins_profile-sandbox" -> (known after apply)
      ~ name        = "jenkins_profile-sandbox" -> "jenkins_profile-ci-sandbox" # forces replacement
        path        = "/"
      ~ role        = "jenkins_dynamic_inventory_role-sandbox" -> "jenkins_dynamic_inventory_role-ci-sandbox"
      ~ roles       = [
          - "jenkins_dynamic_inventory_role-sandbox",
        ] -> (known after apply)
      ~ unique_id   = "AIPAYRXARSKITDVUK2KGV" -> (known after apply)
    }

  # module.jenkins.aws_iam_role.jenkins must be replaced
-/+ resource "aws_iam_role" "jenkins" {
      ~ arn                   = "arn:aws:iam::587807691409:role/jenkins_dynamic_inventory_role-sandbox" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ec2.amazonaws.com"
                        }
                        Sid       = "JenkinsDynamicInventoryAssumeRole"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-12-14T18:29:11Z" -> (known after apply)
        force_detach_policies = false
      ~ id                    = "jenkins_dynamic_inventory_role-sandbox" -> (known after apply)
        max_session_duration  = 3600
      ~ name                  = "jenkins_dynamic_inventory_role-sandbox" -> "jenkins_dynamic_inventory_role-ci-sandbox" # forces replacement
        path                  = "/"
      - tags                  = {} -> null
      ~ unique_id             = "AROAYRXARSKI4HUS54LPU" -> (known after apply)
    }

  # module.jenkins.aws_iam_role_policy.jenkins must be replaced
-/+ resource "aws_iam_role_policy" "jenkins" {
      ~ id     = "jenkins_dynamic_inventory_role-sandbox:jenkins_dynamic_inventory_policy" -> (known after apply)
      ~ name   = "jenkins_dynamic_inventory_policy" -> "jenkins_dynamic_inventory_policy-ci-sandbox" # forces replacement
        policy = jsonencode(
            {
                Statement = [
                    {
                        Action   = [
                            "ec2:Describe*",
                            "rds:Describe*",
                            "route53:ListHostedZones",
                            "route53:ListResourceRecordSets",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ role   = "jenkins_dynamic_inventory_role-sandbox" -> (known after apply) # forces replacement
    }

  # module.jenkins.aws_security_group.default will be destroyed
  - resource "aws_security_group" "default" {
      - arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-0b157bbfc1ef7cea1" -> null
      - description            = "Jenkins security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/8",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - id                     = "sg-0b157bbfc1ef7cea1" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d8a5a65214587007",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d8a5a65214587007",
                ]
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "jenkins-sandbox-tf" -> null
      - owner_id               = "587807691409" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "env" = "sandbox"
        } -> null
      - vpc_id                 = "vpc-0e4d22d8b2666bf6f" -> null
    }

  # module.jenkins.aws_security_group.default1 will be created
  + resource "aws_security_group" "default1" {
      + arn                    = (known after apply)
      + description            = "Jenkins security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0d8a5a65214587007",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0d8a5a65214587007",
                ]
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "jenkins-ci-sandbox-tf"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env" = "sandbox"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.jenkins.aws_security_group_rule.ansible must be replaced
-/+ resource "aws_security_group_rule" "ansible" {
      - cidr_blocks              = [] -> null
        description              = "Allow Ansible access from Jenkins to VPC resources."
        from_port                = 22
      ~ id                       = "sgrule-50594485" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "tcp"
        security_group_id        = "sg-0599014293c0c3234"
        self                     = false
      ~ source_security_group_id = "sg-0b157bbfc1ef7cea1" -> (known after apply) # forces replacement
        to_port                  = 22
        type                     = "ingress"
    }

  # module.jenkins_saml.aws_acm_certificate.lb will be created
  + resource "aws_acm_certificate" "lb" {
      + arn                       = (known after apply)
      + domain_name               = "jenkins-saml.sandbox.datagov.us"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "env" = "sandbox"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.jenkins_saml.aws_acm_certificate_validation.lb will be created
  + resource "aws_acm_certificate_validation" "lb" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.jenkins_saml.aws_iam_instance_profile.jenkins will be created
  + resource "aws_iam_instance_profile" "jenkins" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "jenkins_profile-jenkins-saml-sandbox"
      + path        = "/"
      + role        = "jenkins_dynamic_inventory_role-jenkins-saml-sandbox"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.jenkins_saml.aws_iam_role.jenkins will be created
  + resource "aws_iam_role" "jenkins" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "JenkinsDynamicInventoryAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "jenkins_dynamic_inventory_role-jenkins-saml-sandbox"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.jenkins_saml.aws_iam_role_policy.jenkins will be created
  + resource "aws_iam_role_policy" "jenkins" {
      + id     = (known after apply)
      + name   = "jenkins_dynamic_inventory_policy-jenkins-saml-sandbox"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:Describe*",
                          + "rds:Describe*",
                          + "route53:ListHostedZones",
                          + "route53:ListResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.jenkins_saml.aws_lb_target_group_attachment.lb will be created
  + resource "aws_lb_target_group_attachment" "lb" {
      + id               = (known after apply)
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.jenkins_saml.aws_route53_record.lb will be created
  + resource "aws_route53_record" "lb" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "jenkins-saml"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z05804831W9PRQ2GEV3V1"
    }

  # module.jenkins_saml.aws_route53_record.lb_cert_validation will be created
  + resource "aws_route53_record" "lb_cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05804831W9PRQ2GEV3V1"
    }

  # module.jenkins_saml.aws_security_group.default1 will be created
  + resource "aws_security_group" "default1" {
      + arn                    = (known after apply)
      + description            = "Jenkins security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "jenkins-jenkins-saml-sandbox-tf"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env" = "sandbox"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.jenkins_saml.aws_security_group.lb will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "Load balancer security group for jenkins-saml-sandbox"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "jenkins-saml-sandbox-lb-sg-tf"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.jenkins_saml.aws_security_group_rule.ansible will be created
  + resource "aws_security_group_rule" "ansible" {
      + description              = "Allow Ansible access from Jenkins to VPC resources."
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0599014293c0c3234"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.jenkins.module.jenkins.aws_instance.default[0] will be updated in-place
  ~ resource "aws_instance" "default" {
        ami                          = "ami-0ac80df6eff0e70b5"
        arn                          = "arn:aws:ec2:us-east-1:587807691409:instance/i-08a03167b6cff54ac"
        associate_public_ip_address  = false
        availability_zone            = "us-east-1a"
        cpu_core_count               = 2
        cpu_threads_per_core         = 1
        disable_api_termination      = false
        ebs_optimized                = false
        get_password_data            = false
        hibernation                  = false
      ~ iam_instance_profile         = "jenkins_profile-sandbox" -> "jenkins_profile-ci-sandbox"
        id                           = "i-08a03167b6cff54ac"
        instance_state               = "running"
        instance_type                = "t2.medium"
        ipv6_address_count           = 0
        ipv6_addresses               = []
        key_name                     = "datagov-sandbox"
        monitoring                   = false
        primary_network_interface_id = "eni-03d5a6f06ef72ca29"
        private_dns                  = "ip-10-0-1-211.ec2.internal"
        private_ip                   = "10.0.1.211"
        security_groups              = []
        source_dest_check            = true
        subnet_id                    = "subnet-0bbe8705ad1ce9a08"
        tags                         = {
            "Name"  = "jenkins1tf"
            "env"   = "sandbox"
            "group" = "jenkins"
        }
        tenancy                      = "default"
        volume_tags                  = {
            "env" = "sandbox"
        }
      ~ vpc_security_group_ids       = [
          - "sg-0599014293c0c3234",
          - "sg-0b157bbfc1ef7cea1",
        ] -> (known after apply)

        credit_specification {
            cpu_credits = "standard"
        }

        ebs_block_device {
            delete_on_termination = false
            device_name           = "/dev/xvdh"
            encrypted             = false
            iops                  = 180
            volume_id             = "vol-0a61f2afa2124dcb6"
            volume_size           = 60
            volume_type           = "gp2"
        }

        metadata_options {
            http_endpoint               = "enabled"
            http_put_response_hop_limit = 1
            http_tokens                 = "optional"
        }

        root_block_device {
            delete_on_termination = true
            device_name           = "/dev/sda1"
            encrypted             = false
            iops                  = 100
            volume_id             = "vol-0ea583ab66e6ed5f1"
            volume_size           = 8
            volume_type           = "gp2"
        }
    }

  # module.jenkins_saml.module.jenkins.aws_ebs_volume.default[0] will be created
  + resource "aws_ebs_volume" "default" {
      + arn               = (known after apply)
      + availability_zone = "us-east-1a"
      + encrypted         = (known after apply)
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 8
      + snapshot_id       = (known after apply)
      + tags              = {
          + "env" = "sandbox"
        }
      + type              = "gp2"
    }

  # module.jenkins_saml.module.jenkins.aws_instance.default[0] will be created
  + resource "aws_instance" "default" {
      + ami                          = "ami-053adf54573f777cf"
      + arn                          = (known after apply)
      + associate_public_ip_address  = false
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + iam_instance_profile         = "jenkins_profile-jenkins-saml-sandbox"
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.medium"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "datagov-sandbox"
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-0bbe8705ad1ce9a08"
      + tags                         = {
          + "Name"  = "jenkins-saml1tf"
          + "env"   = "sandbox"
          + "group" = "jenkins"
        }
      + tenancy                      = (known after apply)
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.jenkins_saml.module.jenkins.aws_route53_record.default[0] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "jenkins-saml1tf"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1006361VZ0GA3BRODCA"
    }

  # module.jenkins_saml.module.jenkins.aws_volume_attachment.default[0] will be created
  + resource "aws_volume_attachment" "default" {
      + device_name  = "/dev/xvdh"
      + id           = (known after apply)
      + instance_id  = (known after apply)
      + skip_destroy = true
      + volume_id    = (known after apply)
    }

  # module.jenkins_saml.module.jenkins.null_resource.default[0] will be created
  + resource "null_resource" "default" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.jenkins_saml.module.lb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "jenkins-saml-sandbox-tf"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-03ad95501c749e10a",
          + "subnet-0851c49a6d7007b74",
        ]
      + tags                       = {
          + "Environment" = "sandbox"
          + "Name"        = "jenkins-saml-sandbox-tf"
          + "Terraform"   = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.jenkins_saml.module.lb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.jenkins_saml.module.lb.aws_lb_listener.frontend_https[0] will be created
  + resource "aws_lb_listener" "frontend_https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = (known after apply)
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = (known after apply)
        }
      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = (known after apply)
        }
    }

  # module.jenkins_saml.module.lb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "jenkins-saml-sandbox"
      + port                               = 443
      + protocol                           = "HTTPS"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "sandbox"
          + "Name"        = "jenkins-saml-sandbox"
          + "Terraform"   = "true"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0e4d22d8b2666bf6f"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

Plan: 25 to add, 1 to change, 5 to destroy.

------------------------------------------------------------------------
```